jekyll/_posts/linux/2013-01-04-linux-internationalization.html
---
layout: post
title: Linux 下使用gettext完成程序国际化/本地化
category: linux
change_frequency: monthly
tag: gettext
---



<div id="outline-container-1" class="outline-3">
<h3 id="sec-1">国际化</h3>
<div class="outline-text-3" id="text-1">


<p>
程序的国际化/本地化是指根据用户语言和区域的不同程序可以使用针对用户的交互信息。
</p>
<p>
如，中文用户，则语言会变成中文，时间会显示北京时间，货币会显示RMB。
</p>
<p>
Linux 下 <b>Gnu/gettext</b> 工具套件可以完成语言(message)的本地化/国际化。
</p>
<p>
<b>gettext的官方手册</b> ：<a href="http://www.gnu.org/software/gettext/manual/gettext.html">http://www.gnu.org/software/gettext/manual/gettext.html</a>
</p>
<p>
若要完整的了解和掌握gettext的why，what，how，请看这里。
</p>
</div>

</div>

<div id="outline-container-2" class="outline-3">
<h3 id="sec-2">工具</h3>
<div class="outline-text-3" id="text-2">

<p>gettext套件的工具包括： gettext,xgettext,msgfmt &hellip; 
</p><ul>
<li>gettext : 进行translate，根据LC_MESSAGES环境变量的值和TEXTDOMAIN查找字串对应的本地表示。
</li>
<li>xgettext : 从程序中抽取调用gettext进行本地化的字符串，生成一份.po结尾的配置文件。
</li>
<li>msgfmt : 将配置好的本地化配置文件进行转换成gettext使用的格式。
</li>
</ul>



</div>

</div>

<div id="outline-container-3" class="outline-3">
<h3 id="sec-3">使用gettext进行本地化的步骤</h3>
<div class="outline-text-3" id="text-3">

<ol>
<li>程序编写的时候,
<ul>
<li>在程序开始的地方配置gettext:



<pre class="src src-C">setlocale(lc_ALL,<span style="color: #ffd787;">""</span>); <span style="color: #ffd700;">/* </span><span style="color: #ffd700;">"" &#31354;&#20018;&#65292;&#21017;&#20250;&#26681;&#25454;&#36816;&#34892;&#26102;&#29615;&#22659;&#21464;&#37327;&#30340;&#24773;&#20917;&#20915;&#23450; </span><span style="color: #ffd700;">*/</span>
bindtextdomain(<span style="color: #ffd787;">'myapp'</span>,<span style="color: #ffd787;">'/usr/local/share/locale'</span>)
textdomain(<span style="color: #ffd787;">'myapp'</span>);     
</pre>


</li>
<li>需要本地化的地方调用gettext库函数。如:




<pre class="src src-C">printf (gettext(<span style="color: #ffd787;">"hello,world"</span>)); 
</pre>

<p>
     代替:
</p>


<pre class="src src-C">printf (<span style="color: #ffd787;">"hello,world"</span>);     
</pre>

<p>
     gettext 调用可以使用define宏定义为_(),等于使用gettext()，因而可以简写为(几乎所有程序都这么做):
</p>


<pre class="src src-C">printf (_(<span style="color: #ffd787;">"hello,world"</span>));     
</pre>

</li>
</ul>

</li>
<li>使用xgettext工具处理程序，从中抽取出gettext调用的字符串：



<pre class="src src-C">xgettext -L c -o zh_CN.po myprogram.c   
</pre>

<p>
   假如我想本地化中文: <b>zh_CN</b>
</p></li>
<li>编辑生成的本地化配置文件(zh_CN.po),设置转换对应关系，注意设置编码(charset)为 <b>utf-8</b> ，否则转换可能有问题:



<pre class="src src-perl"><span style="color: #ffd700;"># </span><span style="color: #ffd700;">SOME DESCRIPTIVE TITLE.</span>
<span style="color: #ffd700;"># </span><span style="color: #ffd700;">Copyright (C) YEAR THE PACKAGE'S COPYRIGHT HOLDER</span>
<span style="color: #ffd700;"># </span><span style="color: #ffd700;">This file is distributed under the same license as the PACKAGE package.</span>
<span style="color: #ffd700;"># </span><span style="color: #ffd700;">FIRST AUTHOR &lt;EMAIL</span><span style="color: #0000ee; background-color: #e4e4e4; font-weight: bold;">@ADDRESS</span><span style="color: #ffd700;">&gt;, YEAR.</span>
<span style="color: #ffd700;">#</span>
<span style="color: #ffd700;">#</span><span style="color: #ffd700;">, fuzzy</span>
msgid <span style="color: #ffd787;">""</span>
msgstr <span style="color: #ffd787;">""</span>
<span style="color: #ffd787;">"Project-Id-Version: PACKAGE VERSION\n"</span>
<span style="color: #ffd787;">"Report-Msgid-Bugs-To: \n"</span>
<span style="color: #ffd787;">"POT-Creation-Date: 2013-01-04 17:11+0800\n"</span>
<span style="color: #ffd787;">"PO-Revision-Date: YEAR-MO-DA HO:MI+ZONE\n"</span>
<span style="color: #ffd787;">"Last-Translator: FULL NAME &lt;EMAIL</span><span style="color: #0000ee; background-color: #e4e4e4; font-weight: bold;">@ADDRESS</span><span style="color: #ffd787;">&gt;\n"</span>
<span style="color: #ffd787;">"Language-Team: LANGUAGE &lt;LL</span><span style="color: #0000ee; background-color: #e4e4e4; font-weight: bold;">@li</span><span style="color: #ffd787;">.org&gt;\n"</span>
<span style="color: #ffd787;">"MIME-Version: 1.0\n"</span>
<span style="color: #ffd787;">"Content-Type: text/plain; charset=utf-8\n"</span>
<span style="color: #ffd787;">"Content-Transfer-Encoding: 8bit\n"</span>

<span style="color: #ffd700;">#</span><span style="color: #ffd700;">: t.sh:6</span>
msgid <span style="color: #ffd787;">"hello,world"</span>
msgstr <span style="color: #ffd787;">"&#20320;&#22909;&#65292;&#19990;&#30028;"</span>   
</pre>


<p>
   使用msgfmt工具将配置文件转换成gettext使用的格式：
</p>


<pre class="src src-sh">msgfmt -o /usr/local/share/locale/zh_CN/LC_MESSAGES/myapp.mo zh_CN.po   
</pre>

</li>
<li>验证，设置环境变量LC_MESSAGES或LANG为zh_CN。然后运行程序即可。
</li>
</ol>


</div>

</div>

<div id="outline-container-4" class="outline-3">
<h3 id="sec-4">实例</h3>
<div class="outline-text-3" id="text-4">

<p>shell 使用gettext的示例:
</p>


<pre class="src src-sh"><span style="color: #ffd700; font-style: italic;">TEXTDOMAINDIR</span>=/usr/local/share/locale/ <span style="color: #ffd700;"># </span><span style="color: #ffd700;">&#20026;gettext&#26597;&#25214;&#36335;&#24452;</span>
<span style="color: #ffd700; font-style: italic;">TEXTDOMAIN</span>=myapp.mo <span style="color: #ffd700;">#</span><span style="color: #ffd700;">&#20026;gettext&#26597;&#25214;&#25991;&#20214;&#21517;&#31216;</span>
<span style="color: #ffd700; font-style: italic;">LC_MESSAGES</span>=zh_CN <span style="color: #ffd700;">#</span><span style="color: #ffd700;">gettext&#26597;&#25214;&#36335;&#24452;&#30340;&#26412;&#22320;&#21270;&#37096;&#20998;</span>

<span style="color: #00cdcd; font-weight: bold;">echo</span> <span style="color: #cd00cd;">`gettext "hello,world"`</span>
</pre>


<p>
将会输出:
</p>


<pre class="example">你好中国
</pre>



</div>
</div>
